<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Copyright 2021 Palantir Technologies, Inc.

Licensed under the Apache License, Version 2.0 (the "License");
you may not use this file except in compliance with the License.
You may obtain a copy of the License at

http://www.apache.org/licenses/LICENSE-2.0

Unless required by applicable law or agreed to in writing, software
distributed under the License is distributed on an "AS IS" BASIS,
WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
See the License for the specific language governing permissions and
limitations under the License.</string>
	<key>Description</key>
	<string>Downloads the latest version of log4j-sniffer from the vendor.</string>
	<key>Identifier</key>
	<string>com.github.palantir.download.log4j-sniffer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>log4j-sniffer</string>
		<key>REPO</key>
		<string>palantir/log4j-sniffer</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>log4j-sniffer-(\d\.){3}macos-arm64\.dmg</string>
				<key>github_repo</key>
				<string>%REPO%</string>
			</dict>
			<key>Comment</key>
			<string>GitHubReleasesInfoProvider processor run for arm64 binary.</string>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-arm64-%version%.dmg</string>
			</dict>
			<key>Comment</key>
			<string>URLDownloader processor run for arm64 binary.</string>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%</string>
					<key>requirement</key>
					<string>identifier "log4j-sniffer-%version%.macos-arm64" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = ASJT2NYP59</string>
				</dict>
				<key>Comment</key>
				<string>CodeSignatureVerifier processor run for arm64 binary.</string>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>log4j-sniffer-(\d\.){3}macos-amd64\.dmg</string>
				<key>github_repo</key>
				<string>%REPO%</string>
			</dict>
			<key>Comment</key>
			<string>GitHubReleasesInfoProvider processor run for x86 binary.</string>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-x86-%version%.dmg</string>
			</dict>
			<key>Comment</key>
			<string>URLDownloader processor run for x86 binary.</string>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%</string>
				<key>requirement</key>
				<string>identifier "log4j-sniffer-%version%.macos-amd64" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = ASJT2NYP59</string>
			</dict>
			<key>Comment</key>
			<string>CodeSignatureVerifier processor run for x86 binary.</string>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
