<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Copyright 2019 Palantir Technologies, Inc.

Licensed under the Apache License, Version 2.0 (the "License");
you may not use this file except in compliance with the License.
You may obtain a copy of the License at

http://www.apache.org/licenses/LICENSE-2.0

Unless required by applicable law or agreed to in writing, software
distributed under the License is distributed on an "AS IS" BASIS,
WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
See the License for the specific language governing permissions and
limitations under the License.</string>
	<key>Description</key>
	<string>Downloads the latest version of JetBrains Toolbox from the vendor, creates an installer package, then uploads it to the Jamf Pro server.</string>
	<key>Identifier</key>
	<string>com.github.palantir.jamf.JetBrains Toolbox</string>
	<key>Input</key>
	<dict>
		<key>PACKAGE_CATEGORY</key>
		<string>Utility</string>
		<key>OS_REQUIREMENTS</key>
		<string>12.x,11.x,10.15.x,10.14.x,10.13.x,10.12.x,10.11.x,10.10.x</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>JetBrains Toolbox is a control panel for managing JetBrains application installations.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>%NAME%.png</string>
		<key>SELF_SERVICE_POLICY_NAME</key>
		<string>%NAME%</string>
		<key>SELF_SERVICE_POLICY_TEMPLATE</key>
		<string>JamfUploader-PolicyTemplate-SelfService.xml</string>
		<key>UPDATE_PREDICATE</key>
		<string>pkg_uploaded == False</string>

	</dict>
	<key>MinimumVersion</key>
	<string>2.0.2</string>
	<key>ParentRecipe</key>
	<string>com.github.palantir.pkg.JetBrains Toolbox</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%PACKAGE_CATEGORY%</string>
			</dict>
			<key>Comment</key>
			<string>JamfCategoryUploader processor run for Self Service category.</string>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>os_requirements</key>
				<string>%OS_REQUIREMENTS%</string>
				<key>pkg_category</key>
				<string>%PACKAGE_CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>%UPDATE_PREDICATE%</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>policy_name</key>
				<string>%SELF_SERVICE_POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%SELF_SERVICE_POLICY_TEMPLATE%</string>
				<key>replace_icon</key>
				<true/>
				<key>replace_policy</key>
				<true/>
			</dict>
			<key>Comment</key>
			<string>JamfPolicyUploader processor run for Self Service policy.</string>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
	</array>
</dict>
</plist>
