<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Copyright 2021 Palantir Technologies, Inc.

Licensed under the Apache License, Version 2.0 (the "License");
you may not use this file except in compliance with the License.
You may obtain a copy of the License at

http://www.apache.org/licenses/LICENSE-2.0

Unless required by applicable law or agreed to in writing, software
distributed under the License is distributed on an "AS IS" BASIS,
WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
See the License for the specific language governing permissions and
limitations under the License.</string>
	<key>Description</key>
	<string>Downloads the latest version of log4j-sniffer from the vendor.

Set %include_prereleases% to true in your override to package prelease builds in your environment.

Valid PLATFORM_ARCH arguments:
- "arm64": log4j-sniffer for Apple Silicon Macs (default)
- "amd64": log4j-sniffer for Intel Macs</string>
	<key>Identifier</key>
	<string>com.github.palantir.download.log4j-sniffer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>log4j-sniffer</string>
		<key>PLATFORM_ARCH</key>
		<string>arm64</string>
		<key>REPO</key>
		<string>palantir/log4j-sniffer</string>
		<key>include_prereleases</key>
		<false/>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>log4j-sniffer-(\d\.){3}macos-%PLATFORM_ARCH%\.dmg</string>
				<key>github_repo</key>
				<string>%REPO%</string>
			</dict>
			<key>Comment</key>
			<string>GitHubReleasesInfoProvider processor run.</string>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%PLATFORM_ARCH%-%version%.dmg</string>
			</dict>
			<key>Comment</key>
			<string>URLDownloader processor run.</string>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%</string>
				<key>requirement</key>
				<string>identifier "log4j-sniffer-%version%.macos-%PLATFORM_ARCH%" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = ASJT2NYP59</string>
			</dict>
			<key>Comment</key>
			<string>CodeSignatureVerifier processor run.</string>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
