<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Copyright 2019 Palantir Technologies, Inc.

Licensed under the Apache License, Version 2.0 (the "License");
you may not use this file except in compliance with the License.
You may obtain a copy of the License at

http://www.apache.org/licenses/LICENSE-2.0

Unless required by applicable law or agreed to in writing, software
distributed under the License is distributed on an "AS IS" BASIS,
WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
See the License for the specific language governing permissions and
limitations under the License.</string>
	<key>Description</key>
	<string>Downloads the latest version of JetBrains Toolbox from the vendor, then creates an installer package and extracts the icon.

Valid PLATFORM_ARCH arguments are:
- "macM1": Downloads JetBrains Toolbox for Apple Silicon Macs (default)
- "mac": Downloads JetBrains Toolbox for Intel Macs</string>
	<key>Identifier</key>
	<string>com.github.palantir.pkg.JetBrains Toolbox</string>
	<key>Input</key>
	<dict/>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.palantir.download.JetBrains Toolbox</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%PLATFORM_ARCH%-%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source_app</key>
				<string>%pathname%/JetBrains Toolbox.app</string>
			</dict>
			<key>Processor</key>
			<string>com.github.haircut.processors/AppIconExtractor</string>
		</dict>
	</array>
</dict>
</plist>
